SOAP/ICS_OrderInput.xml

<soapenv:Envelope xmlns:orac="http://xmlns.oracle.com/cpqcloud/commerce/oraclecpqo" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/pcbpel/cloud/connector/cpq/types">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsu:Timestamp wsu:Id="TS-395CAFE23D26544F9114876728580852">
            <wsu:Created>{{CURRENT_DATE}}</wsu:Created>
            <wsu:Expires>{{CURRENT_DATE}}</wsu:Expires>
         </wsu:Timestamp>
         <wsse:UsernameToken wsu:Id="UsernameToken-395CAFE23D26544F9114876728515441">
            <wsse:Username>venkatapraveen.challa@oracle.com</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">ZIc$U$er@1</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">Rk2htGZZ0JEWElRLLGJtWg==</wsse:Nonce>
            <wsu:Created>{{CURRENT_DATE}}</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <typ:process>
         <typ:TransactionType>
             <orac:id>{{TRANSACTION_ID}}</orac:id>
         </typ:TransactionType>
      </typ:process>
   </soapenv:Body>
</soapenv:Envelope>